### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.apim.azurerm_api_management_api.pn_api_v1 will be created
  + resource "azurerm_api_management_api" "pn_api_v1" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "IO COM PN PUBLIC"
      + display_name          = "IO COM PN PUBLIC"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-itn-pn-api-01"
      + path                  = "api/com/v1/pn"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-messages/363a9b80c717364ce6040e0a4681a037562722bd/apps/send-func/openapi/api-pn.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim.azurerm_api_management_api_policy.pn_api_v1_policy will be created
  + resource "azurerm_api_management_api_policy" "pn_api_v1_policy" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-itn-pn-api-01"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = (known after apply)
      + xml_link            = "https://raw.githubusercontent.com/pagopa/io-messages/363a9b80c717364ce6040e0a4681a037562722bd/infra/resources/_modules/apim/api/send/pn-policy.xml"
    }

  # module.apim.azurerm_api_management_product.apim_itn_product_io_com will be created
  + resource "azurerm_api_management_product" "apim_itn_product_io_com" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + approval_required     = false
      + description           = "Product for the IO Comunication team"
      + display_name          = "IO COM"
      + id                    = (known after apply)
      + product_id            = "io-com-product"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = true
    }

  # module.apim.azurerm_api_management_product.apim_itn_product_send_aar will be destroyed
  # (because azurerm_api_management_product.apim_itn_product_send_aar is not in configuration)
  - resource "azurerm_api_management_product" "apim_itn_product_send_aar" {
      - api_management_name   = "io-p-itn-platform-api-gateway-apim-01" -> null
      - approval_required     = false -> null
      - description           = "Product for IO SEND AAR API" -> null
      - display_name          = "IO SEND AAR API" -> null
      - id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/products/io-send-aar-api" -> null
      - product_id            = "io-send-aar-api" -> null
      - published             = true -> null
      - resource_group_name   = "io-p-itn-common-rg-01" -> null
      - subscription_required = true -> null
      - subscriptions_limit   = 0 -> null
        # (1 unchanged attribute hidden)
    }

  # module.apim.azurerm_api_management_product_api.pn_api_v1_product_api will be created
  + resource "azurerm_api_management_product_api" "pn_api_v1_product_api" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-itn-pn-api-01"
      + id                  = (known after apply)
      + product_id          = "io-com-product"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.apim.azurerm_api_management_product_api.send_aar_api_v1_product_api must be replaced
-/+ resource "azurerm_api_management_product_api" "send_aar_api_v1_product_api" {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/products/io-send-aar-api/apis/io-p-itn-send-aar-api-01" -> (known after apply)
      ~ product_id          = "io-send-aar-api" -> "io-com-product" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.apim.azurerm_api_management_product_policy.apim_itn_product_io_com_policy will be created
  + resource "azurerm_api_management_product_policy" "apim_itn_product_io_com_policy" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + id                  = (known after apply)
      + product_id          = "io-com-product"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = (known after apply)
      + xml_link            = "https://raw.githubusercontent.com/pagopa/io-messages/2b0d3d226b95f731c4a6fdf58daff2e6dfcb4ef0/infra/resources/_modules/apim/product/policy.xml"
    }

  # module.apim.azurerm_api_management_product_policy.apim_itn_product_send_policy will be destroyed
  # (because azurerm_api_management_product_policy.apim_itn_product_send_policy is not in configuration)
  - resource "azurerm_api_management_product_policy" "apim_itn_product_send_policy" {
      - api_management_name = "io-p-itn-platform-api-gateway-apim-01" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/products/io-send-aar-api" -> null
      - product_id          = "io-send-aar-api" -> null
      - resource_group_name = "io-p-itn-common-rg-01" -> null
      - xml_content         = <<-EOT
            <policies>
            	<inbound>
            		<base />
            		<!-- PRIVATE PRODUCT -->
            		<ip-filter action="allow">
            			<address-range from="10.0.0.0" to="10.255.255.255" />
            			<address-range from="172.16.2.0" to="172.16.2.255" />
            		</ip-filter>
            	</inbound>
            	<backend>
            		<base />
            	</backend>
            	<outbound>
            		<base />
            	</outbound>
            	<on-error>
            		<base />
            	</on-error>
            </policies>
        EOT -> null
      - xml_link            = "https://raw.githubusercontent.com/pagopa/io-messages/2b0d3d226b95f731c4a6fdf58daff2e6dfcb4ef0/infra/resources/_modules/apim/product/policy.xml" -> null
    }

  # module.web_apps.module.push_notif_function[0].azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-pushnotif-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "0.3.1"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 6 to add, 1 to change, 3 to destroy.
```

</details>
